#+TITLE: December 22, 2018 - January 6, 2018 (16 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
**** DONE Chapter 8. Goroutines and Channels [4/4]
     CLOSED: [2019-01-01 Tue 20:42]
     :PROPERTIES:
     :ESTIMATED: 1.75
     :ACTUAL:   1.28
     :OWNER:    bhavin192
     :ID:       READ.1545719105
     :TASKID:   READ.1545719105
     :END:
     :LOGBOOK:
     CLOCK: [2019-01-01 Tue 20:23]--[2019-01-01 Tue 20:42] =>  0:19
     CLOCK: [2018-12-27 Thu 22:38]--[2018-12-27 Thu 22:54] =>  0:16
     CLOCK: [2018-12-26 Wed 22:46]--[2018-12-26 Wed 23:06] =>  0:20
     CLOCK: [2018-12-26 Wed 21:42]--[2018-12-26 Wed 21:50] =>  0:08
     CLOCK: [2018-12-26 Wed 19:51]--[2018-12-26 Wed 20:05] =>  0:14
     :END:
     - [X] 8.7  Multiplexing with select (20m)
     - [X] 8.8  Example: Concurrent Directory Traversal (40m)
     - [X] 8.9  Cancellation (25m)
     - [X] 8.10 Example: Chat Server (20m)
**** DONE Chapter 8 Exercises [5/5]
     CLOSED: [2019-01-02 Wed 22:40]
     :PROPERTIES:
     :ESTIMATED: 7
     :ACTUAL:   6.02
     :OWNER:    bhavin192
     :ID:       DEV.1545719190
     :TASKID:   DEV.1545719190
     :END:
     :LOGBOOK:
     CLOCK: [2019-01-02 Wed 22:13]--[2019-01-02 Wed 22:40] =>  0:27
     CLOCK: [2019-01-02 Wed 19:02]--[2019-01-02 Wed 19:52] =>  0:50
     CLOCK: [2019-01-01 Tue 18:26]--[2019-01-01 Tue 18:52] =>  0:26
     CLOCK: [2019-01-01 Tue 16:36]--[2019-01-01 Tue 17:35] =>  0:59
     CLOCK: [2018-12-31 Mon 21:20]--[2018-12-31 Mon 21:36] =>  0:16
     CLOCK: [2018-12-27 Thu 21:08]--[2018-12-27 Thu 21:33] =>  0:25
     CLOCK: [2018-12-27 Thu 19:31]--[2018-12-27 Thu 19:50] =>  0:19
     CLOCK: [2018-12-26 Wed 21:53]--[2018-12-26 Wed 22:21] =>  0:28
     CLOCK: [2018-12-25 Tue 22:54]--[2018-12-25 Tue 23:11] =>  0:17
     CLOCK: [2018-12-25 Tue 20:26]--[2018-12-25 Tue 20:48] =>  0:22
     CLOCK: [2018-12-25 Tue 17:28]--[2018-12-25 Tue 18:40] =>  1:12
     :END:
     - [X] 8.6  (1.5h)
     - [X] 8.7  (30m)
     - [X] 8.8  (45m)
     - [X] 8.9  (1.25h)
     - [X] 8.10 (3h)
*** IN_PROGRESS GNU Emacs bug triaging [0/2]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:   0.57
    :OWNER:    bhavin192
    :ID:       OPS.1545721236
    :TASKID:   OPS.1545721236
    :END:
    :LOGBOOK:
    CLOCK: [2019-01-02 Wed 16:39]--[2019-01-02 Wed 17:13] =>  0:34
    :END:
    - [ ] Learn to install particular version of GNU Emacs
    - [ ] Triage 5 bugs
*** DONE freeCodeCamp: Javascript Algorithms and Data Structures  [3/3]
    CLOSED: [2018-12-30 Sun 04:09]
    :PROPERTIES:
    :ESTIMATED: 10
    :ACTUAL:   5.00
    :OWNER: nightwarrior-xxx
    :ID: READ.1539457208
    :TASKID: READ.1539457208
    :END:  
    :LOGBOOK:
    CLOCK: [2018-12-30 Sun 02:52]--[2018-12-30 Sun 04:08] =>  1:16
    CLOCK: [2018-12-29 Sat 15:16]--[2018-12-29 Sat 16:05] =>  0:49
    CLOCK: [2018-12-28 Fri 01:43]--[2018-12-28 Fri 02:11] =>  0:28
    CLOCK: [2018-12-28 Fri 00:16]--[2018-12-28 Fri 01:43] =>  1:27
    CLOCK: [2018-12-27 Thu 20:32]--[2018-12-27 Thu 21:10] =>  0:38
    CLOCK: [2018-12-27 Thu 19:11]--[2018-12-27 Thu 19:33] =>  0:22
    :END:
    - [X] Basic JavaScript                                                                            (2h)
          [[https://learn.freecodecamp.org/javascript-algorithms-and-data-structures/basic-javascript]]   
    - [X] ES6					                                                                                (4h)
          [[https://learn.freecodecamp.org/javascript-algorithms-and-data-structures/es6]]
    - [X] Regular Expressions		                                                                      (4h)
          [[https://learn.freecodecamp.org/javascript-algorithms-and-data-structures/regular-expressions]]
*** DONE [[https://www.shellscript.sh][Shell Scripting Tutorial]] [12/12]
    CLOSED: [2019-01-01 Tue 22:00]
    :PROPERTIES:
    :ESTIMATED: 7
    :ACTUAL:   5.50
    :OWNER: sandeepk
    :ID: read.1545506880
    :TASKID: read.1545506880
    :END:
    :LOGBOOK:
    CLOCK: [2018-12-31 Mon 19:20]--[2018-12-31 Mon 20:00] =>  0:40
    CLOCK: [2018-12-30 Sun 23:00]--[2018-12-30 Sun 23:40] =>  0:40
    CLOCK: [2018-12-30 Sun 20:30]--[2018-12-30 Sun 21:40] =>  1:10
    CLOCK: [2018-12-27 Thu 23:00]--[2018-12-28 Fri 00:00] =>  1:00
    CLOCK: [2018-12-25 Tue 23:00]--[2018-12-26 Wed 00:00] =>  1:00
    CLOCK: [2018-12-24 Mon 19:30]--[2018-12-24 Mon 20:30] =>  1:00
    :END:
    - [X] Revise Chatper 1, 2, 3, 4, 5 (1.3h)
    - [X] Chapter 6 Escape Characters (30m)
    - [X] Chapter 7 Loops (30m)
    - [X] Chapter 8 Test (30m)
    - [X] Chapter 9 Case (30m)
    - [X] Chapter 10 Variable(Part2) (30m)
    - [X] Chapter 11 Variable(Part3) (30m)
    - [X] Chapter 12 External Programs (30m)
    - [X] Chapter 13 Functions (30m)
    - [X] Chapter 14 Hints and Tips (30m)
    - [X] Chapter 15 Quick reference (30m)
    - [X] Chapter 16 Interactive Shell (30m)

*** DONE [[https://www.shellscript.sh/exercises.html][Shell Script Exercise]] [2/2]
   :PROPERTIES:
   :ESTIMATED: 6
   :ACTUAL:   5.08
   :OWNER: sandeepk
   :ID: dev.1545507526
   :TASKID: dev.1545507526
   :END:
   :LOGBOOK:
   CLOCK: [2019-01-04 Fri 20:00]--[2019-01-04 Fri 21:35] =>  1:35
   CLOCK: [2019-01-03 Thu 20:00]--[2019-01-03 Thu 21:00] =>  1:00
   CLOCK: [2019-01-02 Wed 22:00]--[2019-01-02 Wed 23:30] =>  1:30
   CLOCK: [2019-01-02 Wed 19:00]--[2019-01-02 Wed 20:00] =>  1:00
   :END:
   - [X] Address Book (4h)
   - [X] Directory Traversal (2h)

*** DONE Blog Post [5/5]
    :PROPERTIES:
    :ESTIMATED: 3.4
    :ACTUAL:   2.83
    :OWNER: sandeepk
    :ID: read.1545507998
    :TASKID: read.1545507998
    :END:
    :LOGBOOK:
    CLOCK: [2019-01-06 Sun 21:00]--[2019-01-06 Sun 21:20] =>  0:20
    CLOCK: [2019-01-06 Sun 20:00]--[2019-01-06 Sun 20:40] =>  0:40
    CLOCK: [2019-01-05 Sat 20:00]--[2019-01-05 Sat 20:40] =>  0:40
    CLOCK: [2019-01-04 Fri 14:00]--[2019-01-04 Fri 14:30] =>  0:30
    CLOCK: [2019-01-02 Wed 13:30]--[2019-01-02 Wed 14:10] =>  0:40
    :END:
    - [X] [[https://www.nytimes.com/2018/12/17/science/donald-knuth-computers-algorithms-programming.html][The Yoda of Silicon Valley]] (40m)
    - [X] [[https://www.tubefilter.com/2016/06/23/reverse-engineering-youtube-algorithm/][Reverse Engineering The YouTube alog]] (1h)
    - [X] [[https://www.interaction-design.org/literature/article/elaboration-likelihood-model-theory-using-elm-to-get-inside-the-user-s-mind][Elaboration Likehood Model Theory]] (1h)
    - [X] [[https://hackernoon.com/i-finally-understand-static-vs-dynamic-typing-and-you-will-too-ad0c2bd0acc7][Static vs. Dynamic]] (20m)
    - [X] [[https://www.b-list.org/weblog/2018/nov/26/case/][Truths programmers should know about case]] (40m)
